let S = [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22, 23,24,25,26,27,28,29,30,31,32,33,34,35,36];
S[0] = [47,49,51,53,55,57,59,61,63,65];
S[1] = [112,114,116,118,120,122,124,126,128,130];
S[2] = [112,114,116,118,120,122,124,126,128,130];
S[3] = [112,114,116,118,120,122,124,126,128,130];
S[4] = [77,78,79,80,81,82,83,84,85,86];
S[5] = [41,43,45,47,49,51,53,55,57,58,59];
S[6] = [83,85,87,89,91,93,95,97,99,101];
S[7] = [97,99,101,103,105,107,109,111,113,115];
S[8] = [99,101,103,105,107,109,111,113,115,117];
S[9] = [154,156,158,160,162,164,166,168,170,172];
S[10] = [92,94,96,98,100,102,104,106,108,110];
S[11] = [106,108,110,112,114,116,118,120,122,124];
S[12] = [128,130,132,134,136,138,140,142,144,146];
S[13] = [42,44,46,48,50,52,54,56,58,60];
S[14] = [132,134,136,138,140,142,144,146,148,150];
S[15] = [110,112,114,116,118,120,122,124,126,128];
S[16] = [72,74,76,78,80,82,84,86,88,90];
S[17] = [114,116,118,120,122,124,126,128,130,132];
S[18] = [135,137,139,141,143,145,147,149,151,153];
S[19] = [112,114,116,118,120,122,124,126,128,130];
S[20] = [114,116,118,120,122,124,126,128,130,132];
S[21] = [82,84,86,88,90,92,94,96,98,100];
S[22] = [122,124,126,128,130,132,134,136,138,140];
S[23] = [42,44,46,48,50,52,54,56,58,60];
S[24] = [40,42,44,46,48,50,52,54,56,58];
S[25] = [62,64,66,68,70,72,74,76,78,80];
S[26] = [122,124,126,128,130,132,134,136,138,140];
S[27] = [79,81,83,85,87,89,91,93,95,97,99];
S[28] = [72,74,76,78,80,82,84,86,88,90];
S[29] = [67,69,71,73,75,77,79,81,83,85];
S[30] = [72,74,76,78,80,82,84,86,88,90];
S[31] = [131,133,135,137,139,141,143,145,147,149];
S[32] = [93,95,97,99,101,103,105,107,109];
S[33] = [100,102,104,106,108,110,112,114,116,118];
S[34] = [134,136,138,140,142,144,146,148,150,152];
S[35] = [108,110,112,114,116,118,120,122,124,126];
S[36] = [102,104,106,108,110,112,114,116,118,120];
let chaos = 0;
let data = [
 { "name": "ドヒドイデ", "level": 50, "MHP": 125, "HP": 125, "A": 83, "B": 172, "C": 73, "D": 162, "S": 0, "img1": "../ポケモンクエスト画像/ドヒドイデ1.png", "img2": "../ポケモンクエスト画像/ドヒドイデ2.png", "img": "../ポケモンクエスト画像/ドヒドイデ2.png", "bodytype1": "みず", "bodytype2": "どく", "skill1": 4, "skill2": 82, "skill3": 6, "skill4": 7, "F": "さいせいりょく", "heavy": 15, "color1": "#028DFF", "color2": "#A600FF", "Fdp": "引っこめると少し体力が回復する", "heal": 5},
 { "name": "リザードン", "level": 50, "MHP": 153, "HP": 153, "A": 104, "B": 98, "C": 129, "D": 105, "S": 0, "img1": "../ポケモンクエスト画像/リザードン1.png", "img2": "../ポケモンクエスト画像/リザードン2.png", "img": "../ポケモンクエスト画像/リザードン1.png", "bodytype1": "ほのお", "bodytype2": "ひこう", "skill1": 56, "skill2": 54, "skill3": 11, "skill4": 24, "F": "もうか", "heavy": 90, "color1": "#FF421C", "color2": "#ABBFF3", "Fdp": "自身がピンチになると、ほのおタイプの技の威力が上がる", "MGknight": "リザードナイト", "mega": null, "MHPp": 0, "Ap": 46, "Bp": 33, "Cp": 21, "Dp": 0, "Sp": 0, "megaimg1": "../ポケモンクエスト画像/メガリザードンX1.png", "megaimg2": "../ポケモンクエスト画像/メガリザードンX2.png", "Fp": "かたいつめ", "typechange": true, "changetype1": "ほのお", "changetype2": "ドラゴン"},
 { "name": "リザードン", "level": 50, "MHP": 153, "HP": 153, "A": 104, "B": 98, "C": 129, "D": 105, "S": 0, "img1": "../ポケモンクエスト画像/リザードン1.png", "img2": "../ポケモンクエスト画像/リザードン2.png", "img": "../ポケモンクエスト画像/リザードン1.png", "bodytype1": "ほのお", "bodytype2": "ひこう", "skill1": 0, "skill2": 1, "skill3": 54, "skill4": 55, "F": "もうか", "heavy": 90, "color1": "#FF421C", "color2": "#ABBFF3", "Fdp": "自身がピンチになると、ほのおタイプの技の威力が上がる", "MGknight": "リザードナイト", "mega": null, "MHPp": 0, "Ap": 20, "Bp": 0, "Cp": 50, "Dp": 30, "Sp": 0, "megaimg1": "../ポケモンクエスト画像/メガリザードンY1.png", "megaimg2": "../ポケモンクエスト画像/メガリザードンY2.png", "Fp": "ひでり"},
 { "name": "ウルガモス", "level": 50, "MHP": 160, "HP": 160, "A": 80, "B": 85, "C": 155, "D": 125, "S": 0, "img1": "../ポケモンクエスト画像/ウルガモス1.png", "img2": "../ポケモンクエスト画像/ウルガモス2.png", "img": "../ポケモンクエスト画像/ウルガモス2.png", "bodytype1": "むし", "bodytype2": "ほのお", "skill1": 29, "skill2": 8, "skill3": 9, "skill4": 10, "F": "むしのしらせ", "heavy": 46, "color1": "#81EC16", "color2": "#FF421C", "Fdp": "自身がピンチになると、むしタイプの技の威力が上がる"},
 { "name": "バンギラス", "level": 50, "MHP": 175, "HP": 175, "A": 154, "B": 130, "C": 115, "D": 120, "S": 0, "img1": "../ポケモンクエスト画像/バンギラス1.png", "img2": "../ポケモンクエスト画像/バンギラス2.png", "img": "../ポケモンクエスト画像/バンギラス2.png", "bodytype1": "いわ", "bodytype2": "あく", "skill1": 11, "skill2": 12, "skill3": 2, "skill4": 28, "F": "きんちょうかん", "heavy": 202, "color1": "#9A6100", "color2": "#452222", "Fdp": "相手を緊張させ、きのみを食べさせない", "MGknight": "バンギラスナイト", "mega": null, "MHPp": 0, "Ap": 30, "Bp": 40, "Cp": 0, "Dp": 20, "Sp": 10, "megaimg1": "../ポケモンクエスト画像/メガバンギラス1.png", "megaimg2": "../ポケモンクエスト画像/メガバンギラス2.png", "Fp": "すなおこし"},
 { "name": "ブリムオン", "level": 50, "MHP": 132, "HP": 132, "A": 110, "B": 115, "C": 156, "D": 123, "S": 0, "img1": "../ポケモンクエスト画像/ブリムオン1.png", "img2": "../ポケモンクエスト画像/ブリムオン2.png", "img": "../ポケモンクエスト画像/ブリムオン2.png", "bodytype1": "エスパー", "bodytype2": "フェアリー", "skill1": 14, "skill2": 15, "skill3": 16, "skill4": 17, "F": "いやしのこころ", "heavy": 5, "color1": "#FF8DE8", "color2": "#FF58B9", "Fdp": "味方の状態異常をたまに治す", "MAX": null, "MAXimg1": "../ポケモンクエスト画像/ブリムオン(キョダイマックス)1.png", "MAXimg2": "../ポケモンクエスト画像/ブリムオン(キョダイマックス)2.png", "MAXskill1": 18, "MAXskill2": 15, "MAXskill3": 0, "MAXskill4": 8},
 { "name": "キテルグマ", "level": 50, "MHP": 195, "HP": 195, "A": 145, "B": 100, "C": 75, "D": 91, "S": 0, "img1": "../ポケモンクエスト画像/キテルグマ.png", "img2": "../ポケモンクエスト画像/キテルグマ.png", "img": "../ポケモンクエスト画像/キテルグマ.png", "bodytype1": "ノーマル", "bodytype2": "かくとう", "skill1": 18, "skill2": 19, "skill3": 57, "skill4": 20, "F": "もふもふ", "heavy": 135, "color1": "#BBBBBB", "color2": "#FF9900", "Fdp": "相手から受けた接触する技のダメージを半減するが、ほのおタイプの技のダメージは2倍になる"},
 { "name": "ソウブレイズ", "level": 50, "MHP": 150, "HP": 150, "A": 162, "B": 100, "C": 92, "D": 120, "S": 0, "img1": "../ポケモンクエスト画像/ソウブレイズ1.png", "img2": "../ポケモンクエスト画像/ソウブレイズ2.png", "img": "../ポケモンクエスト画像/ソウブレイズ2.png", "bodytype1": "ほのお", "bodytype2": "ゴースト", "skill1": 21, "skill2": 22, "skill3": 23, "skill4": 24, "F": "くだけるよろい", "heavy": 62, "color1": "#FF421C", "color2": "#300770", "Fdp": "物理技でダメージを受けると、ぼうぎょが下がりすばやさがぐーんと上がる"},
 { "name": "セグレイブ", "level": 50, "MHP": 190, "HP": 190, "A": 165, "B": 112, "C": 95, "D": 106, "S": 0, "img1": "../ポケモンクエスト画像/セグレイブ1.png", "img2": "../ポケモンクエスト画像/セグレイブ2.png", "img": "../ポケモンクエスト画像/セグレイブ2.png", "bodytype1": "ドラゴン", "bodytype2": "こおり", "skill1": 26, "skill2": 11, "skill3": 27, "skill4": 28, "F": "ねつこうかん", "heavy": 210, "color1": "#4954A9", "color2": "#44D3FF", "Fdp": "ほのおタイプの技を受けると、こうげきが上がる。また、「やけど」状態にならない"},
 { "name": "ドラパルト", "level": 50, "MHP": 163, "HP": 163, "A": 140, "B": 95, "C": 120, "D": 95, "S": 0, "img1": "../ポケモンクエスト画像/ドラパルト.png", "img2": "../ポケモンクエスト画像/ドラパルト.png", "img": "../ポケモンクエスト画像/ドラパルト.png", "bodytype1": "ドラゴン", "bodytype2": "ゴースト", "skill1": 30, "skill2": 17, "skill3": 31, "skill4": 32, "F": "クリアボディ", "heavy": 50, "color1": "#4954A9", "color2": "#300770", "Fdp": "相手の技や特性で能力を下げられない"},
 { "name": "カイリュー", "level": 50, "MHP": 166, "HP": 166, "A": 154, "B": 115, "C": 120, "D": 120, "S": 0, "img1": "../ポケモンクエスト画像/カイリュー.png", "img2": "../ポケモンクエスト画像/カイリュー.png", "img": "../ポケモンクエスト画像/カイリュー.png", "bodytype1": "ドラゴン", "bodytype2": "ひこう", "skill1": 56, "skill2": 11, "skill3": 57, "skill4": 35, "F": "マルチスケイル", "heavy": 210, "color1": "#4954A9", "color2": "#ABBFF3", "Fdp": "HPが満タンの時に受けるダメージが少なくなる", "heal": 5},
 { "name": "デカヌチャン", "level": 50, "MHP": 160, "HP": 160, "A": 107, "B": 109, "C": 102, "D": 140, "S": 0, "img1": "../ポケモンクエスト画像/デカヌチャン1.png", "img2": "../ポケモンクエスト画像/デカヌチャン2.png", "img": "../ポケモンクエスト画像/デカヌチャン2.png", "bodytype1": "はがね", "bodytype2": "フェアリー", "skill1": 36, "skill2": 37, "skill3": 38, "skill4": 39, "F": "かたやぶり", "heavy": 113, "color1": "#999999", "color2": "#FF58B9", "Fdp": "相手の特性に関係なく攻撃できる"},
 { "name": "エルフーン", "level": 50, "MHP": 135, "HP": 135, "A": 87, "B": 105, "C": 97, "D": 95, "S": 0, "img1": "../ポケモンクエスト画像/エルフーン.png", "img2": "../ポケモンクエスト画像/エルフーン.png", "img": "../ポケモンクエスト画像/エルフーン.png", "bodytype1": "くさ", "bodytype2": "フェアリー", "skill1": 40, "skill2": 41, "skill3": 42, "skill4": 43, "F": "いたずらごころ", "heavy": 7, "color1": "#55D600", "color2": "#FF58B9", "Fdp": "変化技を先制で出すことができる"},
 { "name": "ランクルス", "level": 50, "MHP": 185, "HP": 185, "A": 85, "B": 95, "C": 145, "D": 105, "S": 0, "img1": "../ポケモンクエスト画像/ランクルス.png", "img2": "../ポケモンクエスト画像/ランクルス.png", "img": "../ポケモンクエスト画像/ランクルス.png", "bodytype1": "エスパー", "bodytype2": "null", "skill1": 44, "skill2": 45, "skill3": 46, "skill4": 6, "F": "マジックガード", "heavy": 20, "color1": "#FF8DE8", "color2": "#FFFFFF", "Fdp": "技による直接のダメージ以外を受けない", "heal": 5},
 { "name": "パーモット", "level": 50, "MHP": 145, "HP": 145, "A": 135, "B": 90, "C": 90, "D": 80, "S": 0, "img1": "../ポケモンクエスト画像/パーモット1.png", "img2": "../ポケモンクエスト画像/パーモット2.png", "img": "../ポケモンクエスト画像/パーモット2.png", "bodytype1": "かくとう", "bodytype2": "でんき", "skill1": 47, "skill2": 23, "skill3": 48, "skill4": 49, "F": "てつのこぶし", "heavy": 41, "color1": "#FF9900", "color2": "#FFE000", "Fdp": "パンチを使う技の威力が上がる", "lightout": false, "healout": false},
 { "name": "サザンドラ", "level": 50, "MHP": 167, "HP": 167, "A": 125, "B": 110, "C": 145, "D": 110, "S": 0, "img1": "../ポケモンクエスト画像/サザンドラ1.png", "img2": "../ポケモンクエスト画像/サザンドラ2.png", "img": "../ポケモンクエスト画像/サザンドラ2.png", "bodytype1": "あく", "bodytype2": "ドラゴン", "skill1": 33, "skill2": 50, "skill3": 0, "skill4": 51, "F": "ふゆう", "heavy": 160, "color1": "#452222", "color2": "#4954A9", "Fdp": "じめんタイプの技のダメージを受けない"},
 { "name": "ニンフィア", "level": 50, "MHP": 170, "HP": 170, "A": 85, "B": 85, "C": 130, "D": 150, "S": 0, "img1": "../ポケモンクエスト画像/ニンフィア1.png", "img2": "../ポケモンクエスト画像/ニンフィア2.png", "img": "../ポケモンクエスト画像/ニンフィア1.png", "bodytype1": "フェアリー", "bodytype2": "null", "skill1": 52, "skill2": 53, "skill3": 17, "skill4": 46, "F": "フェアリースキン", "heavy": 23, "color1": "#FF58B9", "color2": "#FFFFFF", "Fdp": "ノーマルタイプの技がフェアリータイプになる"},
 { "name": "ガブリアス", "level": 50, "MHP": 183, "HP": 183, "A": 150, "B": 115, "C": 100, "D": 105, "S": 0, "img1": "../ポケモンクエスト画像/ガブリアス1.png", "img2": "../ポケモンクエスト画像/ガブリアス2.png", "img": "../ポケモンクエスト画像/ガブリアス2.png", "bodytype1": "ドラゴン", "bodytype2": "じめん", "skill1": 11, "skill2": 56, "skill3": 57, "skill4": 7, "F": "すながくれ", "heavy": 95, "color1": "#4954A9", "color2": "#CF9E4E", "Fdp": "天気が「すなあらし」のとき、回避率が上がる"},
 { "name": "マスカーニャ", "level": 50, "MHP": 151, "HP": 151, "A": 146, "B": 90, "C": 101, "D": 90, "S": 0, "img1": "../ポケモンクエスト画像/マスカーニャ1.png", "img2": "../ポケモンクエスト画像/マスカーニャ2.png", "img": "../ポケモンクエスト画像/マスカーニャ2.png", "bodytype1": "くさ", "bodytype2": "あく", "skill1": 58, "skill2": 59, "skill3": 37, "skill4": 60, "F": "へんげんじざい", "heavy": 31, "color1": "#55D600", "color2": "#452222", "Fdp": "戦闘に出るたび1回だけ自分が出す技と同じタイプに変化する"},
 { "name": "ボーマンダ", "level": 50, "MHP": 170, "HP": 170, "A": 155, "B": 100, "C": 130, "D": 100, "S": 0, "img1": "../ポケモンクエスト画像/ボーマンダ1.png", "img2": "../ポケモンクエスト画像/ボーマンダ2.png", "img": "../ポケモンクエスト画像/ボーマンダ2.png", "bodytype1": "ドラゴン", "bodytype2": "ひこう", "skill1": 33, "skill2": 11, "skill3": 61, "skill4": 28, "F": "いかく", "heavy": 103, "color1": "#4954A9", "color2": "#ABBFF3", "Fdp": "相手のこうげきを下げる", "MGknight": "ボーマンダナイト", "mega": null, "MHPp": 0, "Ap": 10, "Bp": 50, "Cp": 10, "Dp": 10, "Sp": 20, "megaimg1": "../ポケモンクエスト画像/メガボーマンダ1.png", "megaimg2": "../ポケモンクエスト画像/メガボーマンダ2.png", "Fp": "スカイスキン"},
 { "name": "コノヨザル", "level": 50, "MHP": 185, "HP": 185, "A": 135, "B": 100, "C": 70, "D": 110, "S": 0, "img1": "../ポケモンクエスト画像/コノヨザル.png", "img2": "../ポケモンクエスト画像/コノヨザル.png", "img": "../ポケモンクエスト画像/コノヨザル.png", "bodytype1": "かくとう", "bodytype2": "ゴースト", "skill1": 62, "skill2": 39, "skill3": 63, "skill4": 64, "F": "まけんき", "heavy": 56, "color1": "#FF9900", "color2": "#300770", "Fdp": "相手に能力を下げられると攻撃がぐーんと上がる", "done": 0},
 { "name": "メタグロス", "level": 50, "MHP": 155, "HP": 155, "A": 155, "B": 150, "C": 115, "D": 110, "S": 0, "img1": "../ポケモンクエスト画像/メタグロス.png", "img2": "../ポケモンクエスト画像/メタグロス.png", "img": "../ポケモンクエスト画像/メタグロス.png", "bodytype1": "はがね", "bodytype2": "エスパー", "skill1": 65, "skill2": 66, "skill3": 11, "skill4": 48, "F": "クリアボディ", "heavy": 550, "color1": "#999999", "color2": "#FF8DE8", "Fdp": "相手の技や特性で能力を下げられない", "MGknight": "メタグロスナイト", "mega": null, "MHPp": 0, "Ap": 10, "Bp": 20, "Cp": 10, "Dp": 20, "Sp": 40, "megaimg1": "../ポケモンクエスト画像/メガメタグロス1.png", "megaimg2": "../ポケモンクエスト画像/メガメタグロス2.png", "Fp": "かたいつめ"},
 { "name": "ゲンガー", "level": 50, "MHP": 135, "HP": 135, "A": 85, "B": 80, "C": 150, "D": 95, "S": 0, "img1": "../ポケモンクエスト画像/ゲンガー.png", "img2": "../ポケモンクエスト画像/ゲンガー.png", "img": "../ポケモンクエスト画像/ゲンガー.png", "bodytype1": "ゴースト", "bodytype2": "どく", "skill1": 5, "skill2": 17, "skill3": 14, "skill4": 67, "F": "ふゆう", "heavy": 40, "color1": "#300770", "color2": "#A600FF", "Fdp": "じめんタイプの技のダメージを受けない", "MGknight": "ゲンガナイト", "mega": null, "MHPp": 0, "Ap": 0, "Bp": 20, "Cp": 40, "Dp": 20, "Sp": 20, "megaimg1": "../ポケモンクエスト画像/メガゲンガー1.png", "megaimg2": "../ポケモンクエスト画像/メガゲンガー2.png", "Fp": "かげふみ"},
 { "name": "ヨワシ", "level": 50, "MHP": 120, "HP": 120, "A": 40, "B": 40, "C": 45, "D": 45, "S": 0, "img1": "../ポケモンクエスト画像/ヨワシ(is)1.png", "img2": "../ポケモンクエスト画像/ヨワシ(is)2.png", "img": "../ポケモンクエスト画像/ヨワシ(is)2.png", "bodytype1": "みず", "bodytype2": "null", "skill1": 4, "skill2": 68, "skill3": 11, "skill4": 69, "F": "ぎょぐん", "heavy": 0.3, "color1": "#028DFF", "color2": "#FFFFFF", "Fdp": "HPが多いときは群れて強くなる。HPの残りが少なくなると群れは散り散りになってしまう", "Ap": 160, "Bp": 150, "Cp": 160, "Dp": 155, "imger1": "../ポケモンクエスト画像/ヨワシ(are)1.png", "imger2": "../ポケモンクエスト画像/ヨワシ(are)2.png", "heavies": 79, "scatter": false},
 { "name": "クレベース", "level": 50, "MHP": 170, "HP": 170, "A": 137, "B": 204, "C": 64, "D": 66, "S": 0, "img1": "../ポケモンクエスト画像/クレベース1.png", "img2": "../ポケモンクエスト画像/クレベース2.png", "img": "../ポケモンクエスト画像/クレベース2.png", "bodytype1": "こおり", "bodytype2": "null", "skill1": 70, "skill2": 71, "skill3": 72, "skill4": 6, "F": "がんじょう", "heavy": 505, "color1": "#44D3FF", "color2": "#FFFFFF", "Fdp": "一撃で倒されない", "heal": 5},
 { "name": "ガチグマ", "level": 50, "MHP": 205, "HP": 205, "A": 160, "B": 125, "C": 65, "D": 100, "S": 0, "img1": "../ポケモンクエスト画像/ガチグマ.png", "img2": "../ポケモンクエスト画像/ガチグマ.png", "img": "../ポケモンクエスト画像/ガチグマ.png", "bodytype1": "じめん", "bodytype2": "ノーマル", "skill1": 73, "skill2": 74, "skill3": 18, "skill4": 37, "F": "こんじょう", "heavy": 290, "color1": "#CF9E4E", "color2": "#BBBBBB", "Fdp": "状態異常のときこうげきが上がる。また、「やけど」状態でもこうげきが下がらない"},
 { "name": "ゾロアーク", "level": 50, "MHP": 135, "HP": 135, "A": 120, "B": 80, "C": 145, "D": 80, "S": 0, "img1": "../ポケモンクエスト画像/ヒスイゾロアーク1.png", "img2": "../ポケモンクエスト画像/ヒスイゾロアーク2.png", "img": "../ポケモンクエスト画像/ヒスイゾロアーク2.png", "bodytype1": "ノーマル", "bodytype2": "ゴースト", "skill1": 75, "skill2": 76, "skill3": 77, "skill4": 78, "F": "イリュージョン", "heavy": 73, "color1": "#BBBBBB", "color2": "#300770", "Fdp": "手持ちのポケモンになりきって出てくる。他のポケモンからのダメージを受けると本来の姿に戻る"},
 { "name": "アーマーガア", "level": 50, "MHP": 173, "HP": 173, "A": 107, "B": 125, "C": 73, "D": 105, "S": 0, "img1": "../ポケモンクエスト画像/アーマーガア1.png", "img2": "../ポケモンクエスト画像/アーマーガア2.png", "img": "../ポケモンクエスト画像/アーマーガア1.png", "bodytype1": "はがね", "bodytype2": "ひこう", "skill1": 79, "skill2": 72, "skill3": 71, "skill4": 35, "F": "プレッシャー", "heavy": 75, "color1": "#999999", "color2": "#ABBFF3", "Fdp": "技を受けたとき、その技のPPを多く減らす", "heal": 5, "MAX": null, "MAXimg1": "../ポケモンクエスト画像/アーマーガア(キョダイマックス)1.png", "MAXimg2": "../ポケモンクエスト画像/アーマーガア(キョダイマックス)2.png", "MAXskill1": 5, "MAXskill2": 2, "MAXskill3": 0, "MAXskill4": 0},
 { "name": "オーロンゲ", "level": 50, "MHP": 170, "HP": 170, "A": 140, "B": 85, "C": 115, "D": 95, "S": 0, "img1": "../ポケモンクエスト画像/オーロンゲ1.png", "img2": "../ポケモンクエスト画像/オーロンゲ2.png", "img": "../ポケモンクエスト画像/オーロンゲ2.png", "bodytype1": "あく", "bodytype2": "フェアリー", "skill1": 80, "skill2": 59, "skill3": 81, "skill4": 88, "F": "いたずらごころ", "heavy": 61, "color1": "#452222", "color2": "#FF58B9", "Fdp": "変化技を先制で出すことができる", "MAX": null, "MAXimg1": "../ポケモンクエスト画像/オーロンゲ(キョダイマックス)1.png", "MAXimg2": "../ポケモンクエスト画像/オーロンゲ(キョダイマックス)2.png", "MAXskill1": 18, "MAXskill2": 17, "MAXskill3": 2, "MAXskill4": 0},
 { "name": "カイリキー", "level": 50, "MHP": 165, "HP": 165, "A": 150, "B": 100, "C": 85, "D": 105, "S": 0, "img1": "../ポケモンクエスト画像/カイリキー1.png", "img2": "../ポケモンクエスト画像/カイリキー2.png", "img": "../ポケモンクエスト画像/カイリキー2.png", "bodytype1": "かくとう", "bodytype2": "null", "skill1": 83, "skill2": 59, "skill3": 84, "skill4": 11, "F": "ノーガード", "heavy": 130, "color1": "#FF9900", "color2": "#FFFFFF", "Fdp": "お互いの技が必ず命中する", "MAX": null, "MAXimg1": "../ポケモンクエスト画像/カイリキー(キョダイマックス)1.png", "MAXimg2": "../ポケモンクエスト画像/カイリキー(キョダイマックス)2.png", "MAXskill1": 20, "MAXskill2": 17, "MAXskill3": 4, "MAXskill4": 4},
 { "name": "ラプラス", "level": 50, "MHP": 205, "HP": 205, "A": 105, "B": 100, "C": 105, "D": 115, "S": 0, "img1": "../ポケモンクエスト画像/ラプラス1.png", "img2": "../ポケモンクエスト画像/ラプラス2.png", "img": "../ポケモンクエスト画像/ラプラス2.png", "bodytype1": "みず", "bodytype2": "こおり", "skill1": 85, "skill2": 86, "skill3": 87, "skill4": 82, "F": "シェルアーマー", "heavy": 220, "color1": "#028DFF", "color2": "#44D3FF", "Fdp": "相手の技が急所に当たらない", "MAX": null, "MAXimg1": "../ポケモンクエスト画像/ラプラス(キョダイマックス)1.png", "MAXimg2": "../ポケモンクエスト画像/ラプラス(キョダイマックス)2.png", "MAXskill1": 11, "MAXskill2": 21, "MAXskill3": 12, "MAXskill4": 0},
 { "name": "エースバーン", "level": 50, "MHP": 155, "HP": 155, "A": 135, "B": 95, "C": 85, "D": 95, "S": 0, "img1": "../ポケモンクエスト画像/エースバーン1.png", "img2": "../ポケモンクエスト画像/エースバーン2.png", "img": "../ポケモンクエスト画像/エースバーン2.png", "bodytype1": "ほのお", "bodytype2": "null", "skill1": 89, "skill2": 90, "skill3": 57, "skill4": 66, "F": "リベロ", "heavy": 33, "color1": "#FF421C", "color2": "#FFFFFF", "Fdp": "戦闘に出るたび1回だけ自分が出す技と同じタイプに変化する", "MAX": null, "MAXimg1": "../ポケモンクエスト画像/エースバーン(キョダイマックス)1.png", "MAXimg2": "../ポケモンクエスト画像/エースバーン(キョダイマックス)2.png", "MAXskill1": 22, "MAXskill2": 2, "MAXskill3": 9, "MAXskill4": 15},
 { "name": "ギャラドス", "level": 50, "MHP": 170, "HP": 170, "A": 145, "B": 99, "C": 80, "D": 120, "S": 0, "img1": "../ポケモンクエスト画像/ギャラドス1.png", "img2": "../ポケモンクエスト画像/ギャラドス2.png", "img": "../ポケモンクエスト画像/ギャラドス2.png", "bodytype1": "みず", "bodytype2": "ひこう", "skill1": 91, "skill2": 92, "skill3": 11, "skill4": 28, "F": "いかく", "heavy": 235, "color1": "#028DFF", "color2": "#ABBFF3", "Fdp": "相手のこうげきを下げる", "MGknight": "ギャラドスナイト", "mega": null, "MHPp": 0, "Ap": 30, "Bp": 30, "Cp": 10, "Dp": 30, "Sp": 0, "megaimg1": "../ポケモンクエスト画像/メガギャラドス1.png", "megaimg2": "../ポケモンクエスト画像/メガギャラドス2.png", "Fp": "かたやぶり", "typechange": true, "changetype1": "みず", "changetype2": "あく"},
 { "name": "ドリュウズ", "level": 50, "MHP": 185, "HP": 185, "A": 155, "B": 80, "C": 70, "D": 85, "S": 0, "img1": "../ポケモンクエスト画像/ドリュウズ1.png", "img2": "../ポケモンクエスト画像/ドリュウズ2.png", "img": "../ポケモンクエスト画像/ドリュウズ1.png", "bodytype1": "じめん", "bodytype2": "はがね", "skill1": 11, "skill2": 57, "skill3": 93, "skill4": 24, "F": "かたやぶり", "heavy": 40, "color1": "#CF9E4E", "color2": "#999999", "Fdp": "相手の特性に関係なく攻撃できる"},
 { "name": "ゲッコウガ", "level": 50, "MHP": 147, "HP": 147, "A": 115, "B": 87, "C": 123, "D": 91, "S": 0, "img1": "../ポケモンクエスト画像/ゲッコウガ.png", "img2": "../ポケモンクエスト画像/ゲッコウガ.png", "img": "../ポケモンクエスト画像/ゲッコウガ.png", "bodytype1": "みず", "bodytype2": "あく", "skill1": 94, "skill2": 50, "skill3": 68, "skill4": 95, "F": "へんげんじざい", "heavy": 40, "color1": "#028DFF", "color2": "#452222", "Fdp": "戦闘に出るたび1回だけ自分が出す技と同じタイプに変化する"},
 { "name": "ミミッキュ", "level": 50, "MHP": 130, "HP": 130, "A": 110, "B": 100, "C": 70, "D": 125, "S": 0, "img1": "../ポケモンクエスト画像/ミミッキュ.png", "img2": "../ポケモンクエスト画像/ミミッキュ.png", "img": "../ポケモンクエスト画像/ミミッキュ.png", "bodytype1": "ゴースト", "bodytype2": "フェアリー", "skill1": 21, "skill2": 37, "skill3": 24, "skill4": 39, "F": "ばけのかわ", "heavy": 0.7, "color1": "#300770", "color2": "#FF58B9", "Fdp": "戦闘中、一度だけ相手の技のダメージを防ぐ", "ghostskin": true, "afterimg": "../ポケモンクエスト画像/ミミッキュ(ばれたすがた).png"},
 { "name": "ルカリオ", "level": 50, "MHP": 145, "HP": 145, "A": 130, "B": 90, "C": 135, "D": 90, "S": 0, "img1": "../ポケモンクエスト画像/ルカリオ1.png", "img2": "../ポケモンクエスト画像/ルカリオ2.png", "img": "../ポケモンクエスト画像/ルカリオ2.png", "bodytype1": "かくとう", "bodytype2": "はがね", "skill1": 23, "skill2": 51, "skill3": 96, "skill4": 48, "F": "せいしんりょく", "heavy": 54, "color1": "#FF9900", "color2": "#999999", "Fdp": "ひるみ状態にならない", "MGknight": "ルカリオナイト", "mega": null, "MHPp": 0, "Ap": 35, "Bp": 18, "Cp": 25, "Dp": 0, "Sp": 22, "megaimg1": "../ポケモンクエスト画像/メガルカリオ1.png", "megaimg2": "../ポケモンクエスト画像/メガルカリオ2.png", "Fp": "てきおうりょく"},
];
let skill = [
 {"id": 0, "name": "かえんほうしゃ", "power": 90, "hitrate": 100, "type": "特殊", "icon": "../ポケモンクエスト画像/ほのおアイコン.png", "sub": "相手を「やけど」状態にすることがある"},
 {"id": 1, "name": "エアスラッシュ", "power": 75, "hitrate": 95, "type": "特殊", "icon": "../ポケモンクエスト画像/ひこうアイコン.png", "sub": "相手をひるませることがある"},
 {"id": 2, "name": "ストーンエッジ", "power": 100, "hitrate": 80, "type": "物理", "icon": "../ポケモンクエスト画像/いわアイコン.png", "sub": "急所に当たりやすい"},
 {"id": 3, "name": "アイアンテール", "power": 100, "hitrate": 70, "type": "物理", "icon": "../ポケモンクエスト画像/はがねアイコン.png", "sub": "相手のぼうぎょを下げることがある"},
 {"id": 4, "name": "ねっとう", "power": 80, "hitrate": 100, "type": "特殊", "icon": "../ポケモンクエスト画像/みずアイコン.png", "sub": "相手を「やけど」状態にすることがある"},
 {"id": 5, "name": "ヘドロウェーブ", "power": 95, "hitrate": 100, "type": "特殊", "icon": "../ポケモンクエスト画像/どくアイコン.png", "sub": "相手を「どく」状態にすることがある"},
 {"id": 6, "name": "じこさいせい", "power": "ー", "hitrate": "ー", "type": "変化", "icon": "../ポケモンクエスト画像/ノーマルアイコン.png", "sub": "自分の最大HPの半分のHPを回復する"},
 {"id": 7, "name": "どくづき", "power": 80, "hitrate": 100, "type": "物理", "icon": "../ポケモンクエスト画像/どくアイコン.png", "sub": "相手を「どく」状態にすることがある"},
 {"id": 8, "name": "むしのていこう", "power": 50, "hitrate": 100, "type": "特殊", "icon": "../ポケモンクエスト画像/むしアイコン.png", "sub": "相手のとくこうを下げる"},
 {"id": 9, "name": "ちょうのまい", "power": "ー", "hitrate": "ー", "type": "変化", "icon": "../ポケモンクエスト画像/むしアイコン.png", "sub": "自分のとくこうととくぼうとすばやさを上げる"},
 {"id": 10, "name": "ほのおのまい", "power": 80, "hitrate": 100, "type": "特殊", "icon": "../ポケモンクエスト画像/ほのおアイコン.png", "sub": "自分のとくこうが上がることがある"},
 {"id": 11, "name": "じしん", "power": 100, "hitrate": 100, "type": "物理", "icon": "../ポケモンクエスト画像/じめんアイコン.png", "sub": " "},
 {"id": 12, "name": "かみくだく", "power": 80, "hitrate": 100, "type": "物理", "icon": "../ポケモンクエスト画像/あくアイコン.png", "sub": "相手をぼうぎょを下げることがある"},
 {"id": 13, "name": "つばめがえし", "power": 60, "hitrate": 100, "type": "物理", "icon": "../ポケモンクエスト画像/ひこうアイコン.png", "sub": "必ず命中する"},
 {"id": 14, "name": "マジカルシャイン", "power": 80, "hitrate": 100, "type": "特殊", "icon": "../ポケモンクエスト画像/フェアリーアイコン.png", "sub": " "},
 {"id": 15, "name": "サイコキネシス", "power": 90, "hitrate": 100, "type": "特殊", "icon": "../ポケモンクエスト画像/エスパーアイコン.png", "sub": "相手のとくぼうを下げることがある"},
 {"id": 16, "name": "トリックルーム", "power": "ー", "hitrate": "ー", "type": "変化", "icon": "../ポケモンクエスト画像/エスパーアイコン.png", "sub": "5ターンの間遅いポケモンから行動できる"},
 {"id": 17, "name": "シャドーボール", "power": 80, "hitrate": 100, "type": "特殊", "icon": "../ポケモンクエスト画像/ゴーストアイコン.png", "sub": "相手のとくぼうを下げることがある"},
 {"id": 18, "name": "かみなりパンチ", "power": 75, "hitrate": 100, "type": "物理", "icon": "../ポケモンクエスト画像/でんきアイコン.png", "sub": "相手を「まひ」状態にすることがある"},
 {"id": 19, "name": "ばかぢから", "power": 120, "hitrate": 100, "type": "物理", "icon": "../ポケモンクエスト画像/かくとうアイコン.png", "sub": "攻撃後、自分のこうげきとぼうぎょが下がる"},
 {"id": 20, "name": "いたみわけ", "power": "ー", "hitrate": "ー", "type": "変化", "icon": "../ポケモンクエスト画像/ノーマルアイコン.png", "sub": "自分のHPと相手のHPをあわせてそれを自分と相手でなかよく分ける"},
 {"id": 21, "name": "シャドークロー", "power": 70, "hitrate": 100, "type": "物理", "icon": "../ポケモンクエスト画像/ゴーストアイコン.png", "sub": "急所に当たりやすい"},
 {"id": 22, "name": "むねんのつるぎ", "power": 90, "hitrate": 100, "type": "物理", "icon": "../ポケモンクエスト画像/ほのおアイコン.png", "sub": "与えたダメージの半分のHPを回復する"},
 {"id": 23, "name": "インファイト", "power": 120, "hitrate": 100, "type": "物理", "icon": "../ポケモンクエスト画像/かくとうアイコン.png", "sub": "攻撃後、自分のぼうぎょととくぼうが下がる"},
 {"id": 24, "name": "つるぎのまい", "power": "ー", "hitrate": "ー", "type": "変化", "icon": "../ポケモンクエスト画像/ノーマルアイコン.png", "sub": "自分のこうげきがぐーんと上げる"},
 {"id": 25, "name": "noname"},
 {"id": 26, "name": "きょけんとつげき", "power": 120, "hitrate": 100, "type": "物理", "icon": "../ポケモンクエスト画像/ドラゴンアイコン.png", "sub": "次のターン相手からの攻撃はダメージが2倍になってしまう"},
 {"id": 27, "name": "つららおとし", "power": 85, "hitrate": 90, "type": "物理", "icon": "../ポケモンクエスト画像/こおりアイコン.png", "sub": "相手をひるませることがある"},
 {"id": 28, "name": "りゅうのまい", "power": "ー", "hitrate": "ー", "type": "変化", "icon": "../ポケモンクエスト画像/ドラゴンアイコン.png", "sub": "自分のこうげきとすばやさを上げる"},
 {"id": 29, "name": "ギガドレイン", "power": 75, "hitrate": 100, "type": "特殊", "icon": "../ポケモンクエスト画像/くさアイコン.png", "sub": "与えたダメージの半分のHPを回復する"},
 {"id": 30, "name": "ドラゴンアロー", "power": 50, "hitrate": 100, "type": "物理", "icon": "../ポケモンクエスト画像/ドラゴンアイコン.png", "sub": "ドラメシヤで2回攻撃。相手が2匹いるときはそれぞれに1回ずつ攻撃する"},
 {"id": 31, "name": "だいもんじ", "power": 120, "hitrate": 85, "type": "特殊", "icon": "../ポケモンクエスト画像/ほのおアイコン.png", "sub": "相手を「やけど」状態にすることがある"},
 {"id": 32, "name": "10まんボルト", "power": 90, "hitrate": 100, "type": "特殊", "icon": "../ポケモンクエスト画像/でんきアイコン.png", "sub": "相手を「まひ」状態にすることがある"},
 {"id": 33, "name": "りゅうせいぐん", "power": 130, "hitrate": 90, "type": "特殊", "icon": "../ポケモンクエスト画像/ドラゴンアイコン.png", "sub": "攻撃後、自分のとくこうががくっと下がる"},
 {"id": 34, "name": "ぼうふう", "power": 110, "hitrate": 70, "type": "特殊", "icon": "../ポケモンクエスト画像/ひこうアイコン.png", "sub": "相手を「こんらん」状態にすることがある"},
 {"id": 35, "name": "はねやすめ", "power": "ー", "hitrate": "ー", "type": "変化", "icon": "../ポケモンクエスト画像/ひこうアイコン.png", "sub": "自分の最大HPの半分のHPを回復する"},
 {"id": 36, "name": "デカハンマー", "power": 160, "hitrate": 100, "type": "物理", "icon": "../ポケモンクエスト画像/はがねアイコン.png", "sub": "この技は2回連続で攻撃できない"},
 {"id": 37, "name": "じゃれつく", "power": 90, "hitrate": 90, "type": "物理", "icon": "../ポケモンクエスト画像/フェアリーアイコン.png", "sub": "相手のこうげきを下げることがある"},
 {"id": 38, "name": "じならし", "power": 60, "hitrate": 100, "type": "物理", "icon": "../ポケモンクエスト画像/じめんアイコン.png", "sub": "相手のすばやさを下げる"},
 {"id": 39, "name": "ドレインパンチ", "power": 75, "hitrate": 100, "type": "物理", "icon": "../ポケモンクエスト画像/かくとうアイコン.png", "sub": "与えたダメージの半分のHPを回復する"},
 {"id": 40, "name": "ムーンフォース", "power": 95, "hitrate": 100, "type": "特殊", "icon": "../ポケモンクエスト画像/フェアリーアイコン.png", "sub": "相手のとくこうを下げることがある"},
 {"id": 41, "name": "エナジーボール", "power": 90, "hitrate": 100, "type": "特殊", "icon": "../ポケモンクエスト画像/くさアイコン.png", "sub": "相手のとくぼうを下げることがある"},
 {"id": 42, "name": "おいかぜ", "power": "ー", "hitrate": "ー", "type": "変化", "icon": "../ポケモンクエスト画像/ひこうアイコン.png", "sub": "4ターンの間味方全員のすばやさを上げる"},
 {"id": 43, "name": "おきみやげ", "power": "ー", "hitrate": "ー", "type": "変化", "icon": "../ポケモンクエスト画像/あくアイコン.png", "sub": "自分はひんしになるがその代わりに相手のこうげきととくこうをがくっと下げる"},
 {"id": 44, "name": "とける", "power": "ー", "hitrate": "ー", "type": "変化", "icon": "../ポケモンクエスト画像/どくアイコン.png", "sub": "自分のぼうぎょがぐーんと上がる"},
 {"id": 45, "name": "アシストパワー", "power": 20, "hitrate": 100, "type": "特殊", "icon": "../ポケモンクエスト画像/エスパーアイコン.png", "sub": "自分の能力が上がっているほど威力が上がる"},
 {"id": 46, "name": "めいそう", "power": "ー", "hitrate": "ー", "type": "変化", "icon": "../ポケモンクエスト画像/エスパーアイコン.png", "sub": "自分のとくこうととくぼうが上げる"},
 {"id": 47, "name": "でんこうそうげき", "power": 120, "hitrate": 100, "type": "物理", "icon": "../ポケモンクエスト画像/でんきアイコン.png", "sub": "攻撃後、自分のでんきタイプがなくなる"},
 {"id": 48, "name": "れいとうパンチ", "power": 75, "hitrate": 100, "type": "物理", "icon": "../ポケモンクエスト画像/こおりアイコン.png", "sub": "相手を「こおり」状態にすることがある"},
 {"id": 49, "name": "さいきのいのり", "power": "ー", "hitrate": "ー", "type": "変化", "icon": "../ポケモンクエスト画像/ノーマルアイコン.png", "sub": "控えにいるひんしのポケモンをHPを半分の状態で復活させる"},
 {"id": 50, "name": "あくのはどう", "power": 80, "hitrate": 100, "type": "特殊", "icon": "../ポケモンクエスト画像/あくアイコン.png", "sub": "相手をひるませることがある"},
 {"id": 51, "name": "ラスターカノン", "power": 80, "hitrate": 100, "type": "特殊", "icon": "../ポケモンクエスト画像/はがねアイコン.png", "sub": "相手のとくぼうを下げることがある"},
 {"id": 52, "name": "ハイパーボイス", "power": 90, "hitrate": 100, "type": "特殊", "icon": "../ポケモンクエスト画像/ノーマルアイコン.png", "sub": " "},
 {"id": 53, "name": "マジカルフレイム", "power": 75, "hitrate": 100, "type": "特殊", "icon": "../ポケモンクエスト画像/ほのおアイコン.png", "sub": "相手のとくこうを下げる"},
 {"id": 54, "name": "ニトロチャージ", "power": 50, "hitrate": 100, "type": "物理", "icon": "../ポケモンクエスト画像/ほのおアイコン.png", "sub": "攻撃後、自分のすばやさを上げる"},
 {"id": 55, "name": "りゅうのはどう", "power": 85, "hitrate": 100, "type": "特殊", "icon": "../ポケモンクエスト画像/ドラゴンアイコン.png", "sub": " "},
 {"id": 56, "name": "ドラゴンクロー", "power": 80, "hitrate": 100, "type": "物理", "icon": "../ポケモンクエスト画像/ドラゴンアイコン.png", "sub": " "},
 {"id": 57, "name": "アイアンヘッド", "power": 80, "hitrate": 100, "type": "物理", "icon": "../ポケモンクエスト画像/はがねアイコン.png", "sub": "相手をひるませることがある"},
 {"id": 58, "name": "トリックフラワー", "power": 70, "hitrate": 100, "type": "物理", "icon": "../ポケモンクエスト画像/くさアイコン.png", "sub": "必ず命中して急所にも当たる"},
 {"id": 59, "name": "はたきおとす", "power": 65, "hitrate": 100, "type": "物理", "icon": "../ポケモンクエスト画像/あくアイコン.png", "sub": " 相手の持ち物をはたき落として戦闘が終わるまで使えなくする"},
 {"id": 60, "name": "けたぐり", "power": "ー", "hitrate": 100, "type": "物理", "icon": "../ポケモンクエスト画像/かくとうアイコン.png", "sub": "相手が重いほど技の威力が上がる"},
 {"id": 61, "name": "ダブルウィング", "power": 40, "hitrate": 90, "type": "物理", "icon": "../ポケモンクエスト画像/ひこうアイコン.png", "sub": "2回連続で攻撃する"},
 {"id": 62, "name": "ふんどのこぶし", "power": 50, "hitrate": 100, "type": "物理", "icon": "../ポケモンクエスト画像/ゴーストアイコン.png", "sub": "受けた攻撃回数が多いほど技の威力が上がる"},
 {"id": 63, "name": "ビルドアップ", "power": "ー", "hitrate": "ー", "type": "変化", "icon": "../ポケモンクエスト画像/かくとうアイコン.png", "sub": "自分のこうげきとぼうぎょを上げる"},
 {"id": 64, "name": "がんせきふうじ", "power": 50, "hitrate": 100, "type": "物理", "icon": "../ポケモンクエスト画像/いわアイコン.png", "sub": "相手のすばやさを下げる"},
 {"id": 65, "name": "コメットパンチ", "power": 90, "hitrate": 90, "type": "物理", "icon": "../ポケモンクエスト画像/はがねアイコン.png", "sub": "自分のこうげきが上がることがある"},
 {"id": 66, "name": "しねんのずつき", "power": 80, "hitrate": 90, "type": "物理", "icon": "../ポケモンクエスト画像/エスパーアイコン.png", "sub": "相手をひるませることがある"},
 {"id": 67, "name": "こごえるかぜ", "power": 55, "hitrate": 95, "type": "物理", "icon": "../ポケモンクエスト画像/こおりアイコン.png", "sub": "相手のすばやさを下げる"},
 {"id": 68, "name": "れいとうビーム", "power": 90, "hitrate": 100, "type": "特殊", "icon": "../ポケモンクエスト画像/こおりアイコン.png", "sub": "相手を「こおり」状態にすることがある"},
 {"id": 69, "name": "がむしゃら", "power": "ー", "hitrate": 100, "type": "物理", "icon": "../ポケモンクエスト画像/ノーマルアイコン.png", "sub": "相手のHPが自分と同じくらいになるようにダメージを与える"},
 {"id": 70, "name": "ゆきなだれ", "power": 60, "hitrate": 100, "type": "物理", "icon": "../ポケモンクエスト画像/こおりアイコン.png", "sub": "相手から技を受けているとその相手に対して技の威力が2倍になる"},
 {"id": 71, "name": "てっぺき", "power": "ー", "hitrate": "ー", "type": "変化", "icon": "../ポケモンクエスト画像/はがねアイコン.png", "sub": "自分のぼうぎょをぐーんと上げる"},
 {"id": 72, "name": "ボディプレス", "power": 80, "hitrate": 100, "type": "物理", "icon": "../ポケモンクエスト画像/かくとうアイコン.png", "sub": "ぼうぎょが高いほど与えるダメージが増える"},
 {"id": 73, "name": "ぶちかまし", "power": 120, "hitrate": 100, "type": "物理", "icon": "../ポケモンクエスト画像/じめんアイコン.png", "sub": "攻撃後、自分のぼうぎょととくぼうが下がる"},
 {"id": 74, "name": "ほのおのパンチ", "power": 75, "hitrate": 100, "type": "物理", "icon": "../ポケモンクエスト画像/ほのおアイコン.png", "sub": "相手を「やけど」状態にすることがある"},
 {"id": 75, "name": "うらみつらみ", "power": 75, "hitrate": 100, "type": "特殊", "icon": "../ポケモンクエスト画像/ゴーストアイコン.png", "sub": "相手のこうげきを下げる"},
 {"id": 76, "name": "バークアウト", "power": 55, "hitrate": 100, "type": "特殊", "icon": "../ポケモンクエスト画像/あくアイコン.png", "sub": "相手のとくこうを下げる"},
 {"id": 77, "name": "きあいだま", "power": 120, "hitrate": 70, "type": "特殊", "icon": "../ポケモンクエスト画像/かくとうアイコン.png", "sub": "相手のとくぼうを下げることがある"},
 {"id": 78, "name": "だいちのちから", "power": 90, "hitrate": 100, "type": "特殊", "icon": "../ポケモンクエスト画像/じめんアイコン.png", "sub": "相手のとくぼうを下げることがある"},
 {"id": 79, "name": "ドリルくちばし", "power": 80, "hitrate": 100, "type": "物理", "icon": "../ポケモンクエスト画像/ひこうアイコン.png", "sub": "　"},
 {"id": 80, "name": "ソウルクラッシュ", "power": 75, "hitrate": 100, "type": "物理", "icon": "../ポケモンクエスト画像/フェアリーアイコン.png", "sub": "相手のとくこうを下げる"},
 {"id": 81, "name": "かわらわり", "power": 75, "hitrate": 100, "type": "物理", "icon": "../ポケモンクエスト画像/かくとうアイコン.png", "sub": "ひかりのかべやリフレクターなども破壊できる"},
 {"id": 82, "name": "まもる", "power": "ー", "hitrate": "ー", "type": "変化", "icon": "../ポケモンクエスト画像/ノーマルアイコン.png", "sub": "相手の攻撃から身を守る。連続で発動すると失敗しやすい"},
 {"id": 83, "name": "クロスチョップ", "power": 100, "hitrate": 80, "type": "物理", "icon": "../ポケモンクエスト画像/かくとうアイコン.png", "sub": "急所に当たりやすい"},
 {"id": 84, "name": "じわれ", "power": "ー", "hitrate": 30, "type": "物理", "icon": "../ポケモンクエスト画像/じめんアイコン.png", "sub": "当たれば一撃でひんしにする"},
 {"id": 85, "name": "うたかたのアリア", "power": 90, "hitrate": 100, "type": "特殊", "icon": "../ポケモンクエスト画像/みずアイコン.png", "sub": "この技を受けたポケモンはやけどが治る"},
 {"id": 86, "name": "フリーズドライ", "power": 70, "hitrate": 100, "type": "特殊", "icon": "../ポケモンクエスト画像/こおりアイコン.png", "sub": "相手を「こおり」状態にすることがある。みずタイプにも効果バツグンになる"},
 {"id": 87, "name": "かみなり", "power": 110, "hitrate": 70, "type": "特殊", "icon": "../ポケモンクエスト画像/でんきアイコン.png", "sub": "相手を「まひ」状態にすることがある"},
 {"id": 88, "name": "リフレクター", "power": "ー", "hitrate": "ー", "type": "変化", "icon": "../ポケモンクエスト画像/エスパーアイコン.png", "sub": "5ターンの間不思議なかべで相手から受ける物理攻撃のダメージを弱める"},
 {"id": 89, "name": "かえんボール", "power": 120, "hitrate": 90, "type": "物理", "icon": "../ポケモンクエスト画像/ほのおアイコン.png", "sub": "相手を「やけど」状態にすることがある"},
 {"id": 90, "name": "とびひざげり", "power": 130, "hitrate": 90, "type": "物理", "icon": "../ポケモンクエスト画像/かくとうアイコン.png", "sub": " "},
 {"id": 91, "name": "たきのぼり", "power": 80, "hitrate": 100, "type": "物理", "icon": "../ポケモンクエスト画像/みずアイコン.png", "sub": " "},
 {"id": 92, "name": "こおりのきば", "power": 75, "hitrate": 100, "type": "物理", "icon": "../ポケモンクエスト画像/こおりアイコン.png", "sub": "相手を「こおり」状態にすることがある"},
 {"id": 93, "name": "いわなだれ", "power": 75, "hitrate": 90, "type": "物理", "icon": "../ポケモンクエスト画像/いわアイコン.png", "sub": "相手をひるませることがある"},
 {"id": 94, "name": "ハイドロポンプ", "power": 110, "hitrate": 80, "type": "特殊", "icon": "../ポケモンクエスト画像/みずアイコン.png", "sub": " "},
 {"id": 95, "name": "アクロバット", "power": 55, "hitrate": 100, "type": "物理", "icon": "../ポケモンクエスト画像/ひこうアイコン.png", "sub": "道具を持っていないと威力が上がる"},
 {"id": 96, "name": "しんそく", "power": 80, "hitrate": 100, "type": "物理", "icon": "../ポケモンクエスト画像/ノーマルアイコン.png", "sub": "必ず先制攻撃できる"},
];